{
  "playwright-para-automatizar-procesos": {
    "id": "01",
    "tags": [
      "story time"
    ],
    "category": "opinión",
    "createdAt": "Date",
    "publishedAt": "2022/02/23",
    "author": "LuisForerop",
    "status": "published",
    "title": "¡Un dramaturgo me ayudó a salir a producción!",
    "brief": "Si quieres *saber* cómo fue que un dramaturgo me facilitó la vida en mi primera salida a producción y lo que aprendí sobre el proceso, acompáñame hasta el final.",
    "readingTime": 5,
    "path": "playwright-para-automatizar-procesos",
    "content": "Hace ya cerca de una semana que salimos a producción (*mi primera vez* 😱) con una migración en la que estuve trabajando por unos *cuatro meses*, y la verdad es que resulta emocionante saber que luego de escribir mucho código, solucionar bugs y adelantar documentación en el proceso, muchos usuarios tendrán contacto directo con tu trabajo.\n\nComo todos sabemos, además de codear, hay más actividades detrás de cualquier proyecto de desarrollo, y en el que trabajé teníamos algunas tareas \"administrativas\". Resulta que luego de crear componentes debíamos lograr que varios de estos se pudieran editar/configurar desde un módulo administrativo, lo cual es realmente sencillo con [VTEX IO](https://developers.vtex.com/vtex-developer-docs/docs/welcome).\n\nHasta ahí, nada raro, pero teniendo en cuenta que el proyecto se trataba de una migración, teníamos que hacer que toda la configuración que ya estaba en producción quedara exactamente igual en nuestra nueva versión. Uno diría que hacer unos cuantos clics, subir una que otra imagen, y configurar algunos numeritos no es nada del otro mundo, pero, ¿qué pasa cuando esos *\"unos cuantos\"* son **más de 60**? La cosa se pone aún más tediosa cuando hablamos de tener que configurar no solo un workspace, sino varios, y posiblemente tenerlo que hacer más de una vez... Así es, resulta que al solucionar un bug, perdimos la configuración de unas 62 páginas 😪.\n\nPara el momento en el que me encomendaron esta tarea estaba bastante 🤔 porque tendría que gastar una buena cantidad de tiempo en un proceso repetitivo, y pues yo soy de los que automatiza hasta el diligenciamiento de un formulario de 4 campos.\n\nPues resulta que acá es donde entra nuestro amigo el \"dramaturgo\" ([playwright](https://playwright.dev) en inglés), que es, nada más y nada menos que, una herramienta para web scraping y testing e2e. Así es, mi amigo el \"dramaturgo\" me ayudó a configurar cerca de 75 páginas en más de dos ocasiones, y cargar unas 60 imágenes para que todo el sitio quedará espectacular. No me llevaré 100% el crédito, porque sin los valiosos videos de Miguel ([Midudev](https://www.instagram.com/midu.dev/) para los amigos) no habría conocido esta herramienta.\n\nLo que hice fue crear una serie de scrapers utilizando playwright, los cuales me ayudaron a recopilar información de la antigua versión, configurar la nueva y verificar que ciertas páginas hubiesen quedado correctamente configuradas luego de la salida a producción.\n\n## ¿Y ya, eso es todo? 🙄\n\nPues no. Por un lado, quería presentarte a **[Playwright](https://playwright.dev)**, un proyecto desarrollado por los mismos creadores de [Selenuim](https://www.selenium.dev), y por otro, contarte tres cosas que aprendí luego de invertir más de 40 horas haciendo pruebas de concepto, implementando un versión básica, creando varios scrapers y dándole un poquito de amor a este proyecto.\n\n 1️⃣ Es posible que *exista una manera **más eficiente** de hacer algo que estás haciendo*: antes de comenzar este mini-proyecto, ya había gastado un tiempo haciendo ciertas configuraciones, pero resultó que el workspace en donde había trabajado no era el que se iba a \"desplegar\" (promover para ser más exactos) a producción, así que ese tiempo se perdió. Al darme cuenta que podría pasar de nuevo, estuve perceptivo a alternativas más eficientes de hacerlo, y cuando vi un stream de Midu en el que creaba un scraper para comprarse una XBOX, me di cuenta que podría usar lo que acababa de ver.\n\n 2️⃣ *Implementa ideas solo **si aportan valor**, porque lo que importa no es la idea sino el problema que resuelve*: tienes que ser consciente de que cada idea en la que vas a trabajar implica un consumo de recursos, sea de tiempo o de equipo, y existe la posibilidad de que no funcione. Analiza si la idea aportará suficiente valor a un proceso o al negocio en general y si está resolviendo un problema real, y si no, quizá sea mejor dejarla en standby o descartarla. Siempre habrán otras ideas por explorar.\n\n 3️⃣ ***No** busques siempre la **perfección***: esto tiene mucho que ver con el desarrollo ágil. La perfección implica mucho tiempo, y cuando no sabes si algo va a funcionar, esto no es la mejor opción. Empieza por una prueba de concepto que te ayude a validar si técnicamente el desarrollo de tu idea es posible, luego trabaja en un MVP, que probablemente sea un caos de código, y si ves que funciona y puede ofrecer mucho (o suficiente) valor, dale \"cariño\" a tu creación haciendo pequeñas refactorizaciones o implementando nuevas funcionalidades.\n\nY tú, ¿alguna vez has tenido que hacer procesos repetitivos y aburridos? ¿los pudiste automatizar?"
  }
}